---
kind: method
id: M:Autodesk.Revit.DB.FamilyPointLocation.GetLocation
source: html/5a016f27-e9ef-d26e-1c0d-0379f0f3101c.htm
---
# Autodesk.Revit.DB.FamilyPointLocation.GetLocation Method

Gets the location of the point.

## Syntax (C#)
```csharp
public Transform GetLocation()
```

## Returns
The location of the point.